app/controllers/api_deploy/v1/containers_controller.rb

SELECT  "plans".* FROM "plans" WHERE "plans"."id" = $1 LIMIT 1  [["id", nil]]
INSERT INTO "containers" ("user_id", "docker_id", "host_id", "port", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 1], ["docker_id", 9], ["host_id", 1], ["port", "60894"], ["created_at", "2015-10-29 15:57:01.948431"], ["updated_at", "2015-10-29 15:57:01.948431"]]
INSERT INTO "games" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "minecraft"], ["created_at", "2015-10-29 13:47:14.977503"], ["updated_at", "2015-10-29 13:47:14.977503"]]
INSERT INTO "plans" ("name", "max_players", "ram", "storage", "storage_type", "game_id", "host_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
      def create
        opts  = params.require(:container)
        plan_id  = opts[:plan_id] or raise ArgumentError.new("Plan id doesn't exists")
        name     = opts[:name] or raise ArgumentError.new("Name doesn't exists")

        plan = Plan.find(plan_id) or raise "Plan with id #{plan_id} doesn't exists"
        game = plan.game.sname

        container = Container.class_for(game).create(current_user, plan, name)

DELETE FROM "containers" WHERE "containers"."id" = $1  [["id", 1]]
---
      def destroy
        @container.destroy_container