app/controllers/api_back/v1/users_controller.rb

INSERT INTO "connects" ("partner", "partner_id", "partner_auth_data", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
INSERT INTO "users" ("email", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["email", "test@test.com"], ["created_at", "2015-10-26 09:05:44.076407"], ["updated_at", "2015-10-26 09:05:44.076407"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
---
      def create
        connect_name = Connect::SUPPORTED_CONNECTS.find { |c| !params["connect_#{c}"].nil? }
        raise "Connect doesn't exists" if connect_name.nil?

        opts = params.require("connect_#{connect_name}")

        connect = Connect::class_for(connect_name).new(opts)

        if connect.existing_connect.nil?
          connect.user = User.find_by_email(connect.email) || User.create(email: connect.email, full_name: connect.full_name)